#Python - Non-technical introduction

##SOLUTION Exercise Day 2 Session 2: "Select the needle in a haystack: How to use “select” operations?"

This file provides the solutions to the exercises accompanying the lectures.

*Note:* If you want to make changes to this document, you need to save your own copy using the "Save copy in Drive" command in the "File" menu.

###Preparation

**Make sure to run the follwing code before continuing.** Code will prepare everything (load data, ...).

In [ ]:
#%% Import relevant modules
import pandas as pd
import numpy as np
# Read in data
myData=pd.read_csv("https://raw.githubusercontent.com/bachmannpatrick/Python-Class/master/data/transactions.csv")
#fix the Date format
myData["TransDate"]  = pd.to_datetime(myData["TransDate"])

###16 - Data wrangling techniques

No exercises for this unit.

###17 - Selectiong rows

1. Select rows 10 to 20 (inlcuding 20) from the `myData` DataFrame. *Hint:* Please have a careful look at the terminology. The row number of the first line is 1, the row index of the first line is 0.

In [ ]:
myData.iloc[9:20,]

    Customer  TransDate  Quantity  PurchAmount   Cost    TransID
9     140729 2012-04-28         1        89.95  35.00  129377737
10    140729 2012-04-28         1        69.95  26.40  129377737
11    180970 2009-06-19         1       119.95  58.46  129195647
12    180970 2009-06-19         1        27.95  12.51  129195647
13    149332 2005-12-13         1        49.95  24.87  129878743
14    149332 2006-05-10         1        24.95  12.50  129883508
15    182927 2009-11-02         2        59.90  15.92  129290963
16    182927 2009-11-02         1        34.95  15.75  129290963
17    182927 2009-11-02         1       129.95  63.08  129290963
18    182927 2009-11-02         1        24.95   8.00  129290963
19    182927 2009-11-24         1        34.95  15.75  130979949

2. Select all purchases from 2010 from the myData DataFrame.

In [ ]:
myData.loc[(myData["TransDate"]>pd.to_datetime("2009-12-31")) & (myData["TransDate"]<=pd.to_datetime("2010-12-31")), ]

        Customer  TransDate  Quantity  PurchAmount    Cost    TransID
41        105474 2010-04-30         1       349.95  160.00  131139020
50        103744 2010-04-03         1        69.95   28.00  131123290
51        103744 2010-04-03         1        69.95   28.00  131123290
52        103744 2010-04-03         1        19.95    2.30  131123290
53        103744 2010-04-03         1        19.95    2.30  131123290
...          ...        ...       ...          ...     ...        ...
191724    163118 2010-12-31         1        89.95   52.53  128474646
191725    163120 2010-12-31         1        59.95   23.75  128474822
191726    163121 2010-12-31         1        34.95   16.44  128474938
191727    163123 2010-12-31         1        39.95   15.56  128475013
191728    163123 2010-12-31         1        39.95   16.23  128475013

[32282 rows x 6 columns]

3. Select purchases made on 19.12.2010 or on 21.12.2010 from the `myData` DataFrame. *Hint:* Make sure the date variable is in the correct format.

In [ ]:
myData.loc[(myData["TransDate"]==pd.to_datetime("2010-12-19")) | (myData["TransDate"]==pd.to_datetime("2010-12-21"))]

        Customer  TransDate  Quantity  PurchAmount    Cost    TransID
1218      130530 2010-12-19         1        24.95    7.50  128441051
1219      130530 2010-12-19         1        99.95   40.00  128441051
5150      102439 2010-12-19         1       399.95  235.00  131408614
5151      102439 2010-12-19         2        49.90   24.00  131408614
5152      102439 2010-12-19         1       349.95  227.00  131408614
...          ...        ...       ...          ...     ...        ...
191334    100273 2010-12-21         1        49.95   24.99  123501690
191335    162649 2010-12-21         1        69.95   29.40  128451507
191337    162650 2010-12-21         1       129.95   54.00  128451520
191338    162653 2010-12-21         1       349.95  227.00  128451575
191339    162655 2010-12-21         1       149.95   66.00  128451683

[328 rows x 6 columns]

In [ ]:
#alternative solution
myData.loc[myData["TransDate"].isin([pd.to_datetime("2010-12-19"), pd.to_datetime("2010-12-21")]),]

        Customer  TransDate  Quantity  PurchAmount    Cost    TransID
1218      130530 2010-12-19         1        24.95    7.50  128441051
1219      130530 2010-12-19         1        99.95   40.00  128441051
5150      102439 2010-12-19         1       399.95  235.00  131408614
5151      102439 2010-12-19         2        49.90   24.00  131408614
5152      102439 2010-12-19         1       349.95  227.00  131408614
...          ...        ...       ...          ...     ...        ...
191334    100273 2010-12-21         1        49.95   24.99  123501690
191335    162649 2010-12-21         1        69.95   29.40  128451507
191337    162650 2010-12-21         1       129.95   54.00  128451520
191338    162653 2010-12-21         1       349.95  227.00  128451575
191339    162655 2010-12-21         1       149.95   66.00  128451683

[328 rows x 6 columns]

4. Select all purchases with quantities between 2 and 5 (including 2 and 5) from the `myData` DataFrame.

In [ ]:
myData.loc[(myData["Quantity"]>=2) & (myData["Quantity"]<=5),]

        Customer  TransDate  Quantity  PurchAmount    Cost    TransID
15        182927 2009-11-02         2        59.90   15.92  129290963
45        103744 2006-12-04         2       179.90   80.96  128327768
95        166430 2009-12-11         2        59.90   26.28  131031402
115       192852 2010-11-08         3       149.85   67.98  131286487
116       192852 2010-11-08         3        14.85    3.24  131286487
...          ...        ...       ...          ...     ...        ...
222764    199445 2012-09-05         2       259.90  120.00  131962640
222854    199467 2012-09-06         2        59.90   24.00  131964938
222869    199469 2012-09-07         2       119.90   60.00  131965402
223013    199507 2012-09-11         2        99.90   28.08  131968692
223076    199517 2012-09-13         2        69.90   25.30  131970153

[5121 rows x 6 columns]

5. Select all purchases with purchase amount greater than 100 which were made from 01.01.2009 onwards from the `myData` DataFrame.

In [ ]:
myData.loc[(myData["TransDate"]>pd.to_datetime("2009-01-01")) & (myData["PurchAmount"]>100), ]

###18 - Selecting columns

1. First, select rows 1 to 100 and save the subset in your working environment.

In [ ]:
myData.iloc[0:100, ]

    Customer  TransDate  Quantity  PurchAmount    Cost    TransID
0     149332 2005-11-15         1       199.95  107.00  127998739
1     172951 2008-08-29         1       199.95  108.00  128888288
2     120621 2007-10-19         1        99.95   49.00  125375247
3     149236 2005-11-14         1        39.95   18.95  127996226
4     149236 2007-12-06         1        79.95   35.00  128670302
..       ...        ...       ...          ...     ...        ...
95    166430 2009-12-11         2        59.90   26.28  131031402
96    166430 2009-12-11         1        49.95   19.68  131031402
97    166430 2009-12-11         1        49.95   14.00  131031402
98    166430 2009-12-30         1        54.95   22.60  131057187
99    187038 2007-09-24         1        39.95   22.63  129908139

[100 rows x 6 columns]

2. From this, select the following columns: `Customer`, `TransDate`, and `Quantity`.

In [ ]:
#Variante 1:
myData[["Customer","TransDate", "Quantity"]].iloc[0:100,]

    Customer  TransDate  Quantity
0     149332 2005-11-15         1
1     172951 2008-08-29         1
2     120621 2007-10-19         1
3     149236 2005-11-14         1
4     149236 2007-12-06         1
..       ...        ...       ...
95    166430 2009-12-11         2
96    166430 2009-12-11         1
97    166430 2009-12-11         1
98    166430 2009-12-30         1
99    187038 2007-09-24         1

[100 rows x 3 columns]

In [ ]:
#Variante 2
myData.iloc[0:100][["Customer","TransDate", "Quantity"]]

    Customer  TransDate  Quantity
0     149332 2005-11-15         1
1     172951 2008-08-29         1
2     120621 2007-10-19         1
3     149236 2005-11-14         1
4     149236 2007-12-06         1
..       ...        ...       ...
95    166430 2009-12-11         2
96    166430 2009-12-11         1
97    166430 2009-12-11         1
98    166430 2009-12-30         1
99    187038 2007-09-24         1

[100 rows x 3 columns]

In [ ]:
#Variante 3
myData.iloc[0:100, [0,1,2]]

In [ ]:
#Variante 4
myData.iloc[0:100,0:3]

3. Select the columns `Customer` and `Cost` from all rows with a purchase amount  between 100 and 200.

In [ ]:
myData.loc[(myData["PurchAmount"]>100)&(myData["PurchAmount"]<200), ["Customer","Cost"]]

        Customer    Cost
0         149332  107.00
1         172951  108.00
5         140729   59.00
11        180970   58.46
17        182927   63.08
...          ...     ...
223164    199539   40.25
223166    186343   63.00
223167    186344   54.50
223176    199996  104.99
223189    199999  109.99

[33818 rows x 2 columns]

###19 - Appending and updating rows and columns

1. Create a new column calculating the difference between `PurchAmount` and `Cost`. Call it `Profit`.

In [ ]:
myData["Profit"] = myData["PurchAmount"]-myData["Cost"]
print(myData)

        Customer  TransDate  Quantity  PurchAmount    Cost    TransID  Profit
0         149332 2005-11-15         1       199.95  107.00  127998739   92.95
1         172951 2008-08-29         1       199.95  108.00  128888288   91.95
2         120621 2007-10-19         1        99.95   49.00  125375247   50.95
3         149236 2005-11-14         1        39.95   18.95  127996226   21.00
4         149236 2007-12-06         1        79.95   35.00  128670302   44.95
...          ...        ...       ...          ...     ...        ...     ...
223186    199997 2012-09-17         1        29.95   13.80  132481149   16.15
223187    199997 2012-09-17         1        29.95   13.80  132481149   16.15
223188    199998 2012-09-17         1        29.95   13.80  132481154   16.15
223189    199999 2012-09-17         1       179.95  109.99  132481165   69.96
223190    199542 2012-09-17         1        39.95   10.50  131973368   29.45

[223191 rows x 7 columns]

2. Rename Profit to `ProfitChange`.

In [ ]:
#Variant 1:
myData=myData.rename(columns = {"Profit":"ProfitChange"})
print(myData)

        Customer  TransDate  Quantity  ...    Cost    TransID  ProfitChange
0         149332 2005-11-15         1  ...  107.00  127998739         92.95
1         172951 2008-08-29         1  ...  108.00  128888288         91.95
2         120621 2007-10-19         1  ...   49.00  125375247         50.95
3         149236 2005-11-14         1  ...   18.95  127996226         21.00
4         149236 2007-12-06         1  ...   35.00  128670302         44.95
...          ...        ...       ...  ...     ...        ...           ...
223186    199997 2012-09-17         1  ...   13.80  132481149         16.15
223187    199997 2012-09-17         1  ...   13.80  132481149         16.15
223188    199998 2012-09-17         1  ...   13.80  132481154         16.15
223189    199999 2012-09-17         1  ...  109.99  132481165         69.96
223190    199542 2012-09-17         1  ...   10.50  131973368         29.45

[223191 rows x 7 columns]

In [ ]:
#Variant 2:
myData.rename(columns = {"Profit":"ProfitChange"},inplace=True)
print(myData)

3. Delete `ProfitChange` again

In [ ]:
del myData["ProfitChange"]

In [ ]:
#reset the dataset by reading it again
#Read the csv file and store it in the variable "myData". Note: this file is hostes in a GitHub repository.
myData=pd.read_csv(filepath_or_buffer="https://raw.githubusercontent.com/bachmannpatrick/Python-Class/master/data/transactions.csv", sep=",")
# Adjust the format of column "TransDate" to datetime
myData["TransDate"]  = pd.to_datetime(myData["TransDate"])

4. Create a copy of `myData` and name it `mydata_toppurchases`. In the new DataFrame delete all transactions with a `PurchAmount` smaller than 100.

In [ ]:
#Create a copy of myData name and it "mydata.toppurchases".
myData_toppurchases=myData.copy()
#In the new DataFrame delete all customers with a PurchAmount smaller than 100.
myData_toppurchases=myData_toppurchases.loc[myData_toppurchases["PurchAmount"]>100, ]
# Check whether there are no cases smaller than 100
myData_toppurchases["PurchAmount"].min()

100.47